js216/stm32mp135_test_board/baremetal/qspi/src/cli.c
   my_printf("mdma_begin %lu B %s\r\n",
             (unsigned long)len,
             quad ? "quad" : "1lane");
   const uint32_t t0 = HAL_GetTick();
   HAL_StatusTypeDef s = qspi_mdma_read(opcode, dl, dummy, len,
                                        raw != 0U, dst, 60000U, true);
   const uint32_t xfer_ms = HAL_GetTick() - t0;
   if (s != HAL_OK) {
      my_printf("ERR mdma (%d) dt=%lu\r\n",
                (int)s, (unsigned long)xfer_ms);
      busy_flag = false;
      return;
   }
   uint32_t xfer_dt = xfer_ms;
   if (xfer_dt == 0U) xfer_dt = 1U;
   uint32_t xfer_mbps_x10;
   if (len <= 50000000U)
      xfer_mbps_x10 = (len * 80U) / (xfer_dt * 1000U);
   else
      xfer_mbps_x10 = ((len / 1000U) * 80U) / xfer_dt;
   my_printf("mdma_xfer %lu B %s in %lu ms, %lu.%lu Mbps\r\n",
             (unsigned long)len,
             quad ? "quad" : "1lane",
             (unsigned long)xfer_ms,
             (unsigned long)(xfer_mbps_x10 / 10U),
             (unsigned long)(xfer_mbps_x10 % 10U));

   /* CRC32 + first-error scan over the DDR buffer. */
   const uint32_t validate_t0 = HAL_GetTick();
   uint32_t crc       = 0xFFFFFFFFUL;
   uint32_t first_err = 0xFFFFFFFFUL;
   for (uint32_t i = 0; i < len; i++) {
      const uint8_t b = p[i];
      crc ^= (uint32_t)b;
      for (int j = 0; j < 8; j++)
         crc = (crc >> 1) ^ (0xEDB88320UL & (-(int32_t)(crc & 1U)));
      const uint8_t exp = (uint8_t)(i & 0xFFU);
      if (b != exp && first_err == 0xFFFFFFFFUL)
         first_err = i;
   }
   crc ^= 0xFFFFFFFFUL;
   const uint32_t validate_ms = HAL_GetTick() - validate_t0;

   uint32_t dt = xfer_ms;
   if (dt == 0U) dt = 1U;
   uint32_t mbps_x10;
   if (len <= 50000000U)
      mbps_x10 = (len * 80U) / (dt * 1000U);
   else
      mbps_x10 = ((len / 1000U) * 80U) / dt;

   const long firsterr_signed =
       (first_err == 0xFFFFFFFFU) ? -1L : (long)first_err;
   my_printf("mdma %lu B %s in %lu ms, %lu.%lu Mbps, "
             "crc32=%08lx, expect=%08lx, firsterr=%ld, "
             "xfer=%lu ms, validate=%lu ms, "
             "poison=%lu ms, auto=%s\r\n",
             (unsigned long)len,
             quad ? "quad" : "1lane",
             (unsigned long)dt,
             (unsigned long)(mbps_x10 / 10U),
             (unsigned long)(mbps_x10 % 10U),
             (unsigned long)crc,
             (unsigned long)crc32_expected(len),
             firsterr_signed,
             (unsigned long)xfer_ms,
             (unsigned long)validate_ms,
             (unsigned long)poison_ms,
             auto_consume ? "on" : "off");
   busy_flag = true;
}

/* DDR ping-pong auto-consume MDMA path.  This keeps the bulk-DDR `m`
 * command intact but gives sustained-stream bring-up a separate command
 * whose validation consumes completed chunks into one running CRC. */
static void cmd_auto_stream(int argc, char **argv)
{
   uint32_t len   = arg_u32(argc > 0 ? argv[0] : NULL, 4096U);
   uint32_t quad  = arg_u32(argc > 1 ? argv[1] : NULL, 0U);
   uint32_t raw   = arg_u32(argc > 2 ? argv[2] : NULL, 1U);
   uint32_t chunk = arg_u32(argc > 3 ? argv[3] : NULL, STREAM_CHUNK_BYTES);
   if (len == 0U)
      len = 4096U;
   if (chunk == 0U)
      chunk = STREAM_CHUNK_BYTES;
   if (chunk & 0xFFFFU) {
      my_printf("ERR stream: chunk must be 64 KB-aligned\r\n");
      return;
   }
   if (len & 0xFFFFU) {
      my_printf("ERR stream: len must be 64 KB-aligned\r\n");
      return;
   }
   busy_flag = true;

   const uint8_t  opcode = quad ? 0x6BU : 0x0BU;
   const qspi_lines_t dl = quad ? QSPI_LINES_4 : QSPI_LINES_1;
   const uint8_t dummy   = raw ? 0U : 8U;

   uint32_t crc       = CRC32_INIT;
   uint32_t first_err = 0xFFFFFFFFUL;
   uint32_t done      = 0U;
   uint32_t chunks    = 0U;
   const uint32_t t0  = HAL_GetTick();

   while (done < len) {
      uint32_t n = len - done;
      if (n > chunk)
         n = chunk;
      volatile uint8_t *p =
          (volatile uint8_t *)(DEF_DDR_BASE + ((chunks & 1U) * chunk));
      HAL_StatusTypeDef s = qspi_mdma_read(opcode, dl, dummy, n,
                                           raw != 0U, (uint32_t)p, 60000U,
                                           false);
      if (s != HAL_OK) {
         my_printf("ERR stream (%d) done=%lu\r\n",
                   (int)s, (unsigned long)done);
         busy_flag = false;
         return;
      }
      if (auto_consume)
         crc = crc32_update_buf(crc, p, n, done, NULL);
      done += n;
      chunks++;
   }

   const uint32_t dt_raw = HAL_GetTick() - t0;
   uint32_t dt = dt_raw;
   if (dt == 0U)
      dt = 1U;
   uint32_t mbps_x10;
   if (len <= 50000000U)
      mbps_x10 = (len * 80U) / (dt * 1000U);
   else
      mbps_x10 = ((len / 1000U) * 80U) / dt;

   if (!auto_consume) {
      crc = CRC32_INIT;
      first_err = 0xFFFFFFFFUL;
   }
   crc ^= CRC32_XOROUT;
   const uint32_t expect_crc = crc32_expected(len);
   if (auto_consume)
      first_err = (crc == expect_crc) ? 0xFFFFFFFFUL : 0xFFFFFFFEUL;
   const long firsterr_signed =
       (first_err == 0xFFFFFFFEU) ? -2L :
       (first_err == 0xFFFFFFFFU) ? -1L : (long)first_err;
   my_printf("stream %lu B %s in %lu ms, %lu.%lu Mbps, crc32=%08lx, "
             "expect=%08lx, firsterr=%ld, chunk=%lu, chunks=%lu, buf=%s, auto=%s, "
             "presc=%lu, qspi_hz=%lu\r\n",
             (unsigned long)len,
             quad ? "quad" : "1lane",
             (unsigned long)dt_raw,
             (unsigned long)(mbps_x10 / 10U),
             (unsigned long)(mbps_x10 % 10U),
             (unsigned long)crc,
             (unsigned long)expect_crc,
             firsterr_signed,
             (unsigned long)chunk,
             (unsigned long)chunks,
             "ddr",
             auto_consume ? "on" : "off",
             (unsigned long)qspi_get_prescaler(),
             (unsigned long)qspi_kernel_hz());
   busy_flag = true;
}

static void cmd_auto_consume(int argc, char **argv)
{
   if (argc < 1) {
      my_printf("auto=%s\r\n", auto_consume ? "on" : "off");
      return;
   }
   uint32_t on = arg_u32(argv[0], auto_consume ? 1U : 0U);
   auto_consume = on ? true : false;
   my_printf("auto=%s\r\n", auto_consume ? "on" : "off");
}

