js216/stm32mp135_test_board/baremetal/qspi/src/cli.c
   char *argv[MAX_ARGS];
   int argc = parse_args(line, argv, MAX_ARGS);

   switch (op) {
      case 'i': cmd_jedec();                      break;
      case 'f': cmd_sfdp(argc, argv);             break;
      case 's': cmd_status(argc, argv);           break;
      case '?': cmd_query();                      break;
      case 'r': cmd_read(argc, argv);             break;
      case 'F': cmd_fast_read(argc, argv);        break;
      case 'q': cmd_quad_read(argc, argv);        break;
      case 'X': cmd_quad_io_read(argc, argv);     break;
      case '2': cmd_dual_read(argc, argv);        break;
      case '3': cmd_dual_io_read(argc, argv);     break;
      case 'M': cmd_mm(argc, argv);               break;
      case 'b': cmd_bench(argc, argv);            break;
      case 'm': cmd_mdma(argc, argv);             break;
      case 'a': cmd_auto_consume(argc, argv);     break;
      case 'A': cmd_auto_stream(argc, argv);      break;
      case 'j': cmd_raw_read(argc, argv);         break;
      case 'J': cmd_raw_write(argc, argv);        break;
      case 'e': cmd_op_only(argc, argv);          break;
      case 'W': cmd_wrsr(argc, argv);             break;
      case 'w': cmd_pp(argc, argv);               break;
      case 'Q': cmd_qpp(argc, argv);              break;
      case 'S': cmd_erase(0x20U, 4U, argc, argv); break;
      case 'B': cmd_erase(0xD8U, 64U, argc, argv);break;
      case 'C': cmd_chip_erase_pending();         break;
      case 'P': cmd_autopoll(argc, argv);         break;
      case '4': cmd_4byte(argc, argv);            break;
      case 'R': cmd_reset();                      break;
      case 'D': cmd_dpd();                        break;
      case 'd': cmd_release_dpd();                break;
      case 'p': cmd_prescaler(argc, argv);        break;
      case 'g': cmd_gpio(argc, argv);             break;
      case 'G': cmd_gpio_read();                  break;
      case 'k': cmd_gpio_bitbang_read(argc, argv); break;
      case 't': cmd_toggle(argc, argv);           break;
      case 'x': cmd_abort();                      break;
      case 'h': cmd_help();                       break;
      default:
         my_printf("? unknown '%c' (h for help)\r\n", op);
         break;
   }
}

static void cli_putc(char c)
{
   while (!(UART4->ISR & USART_ISR_TXE))
      rx_drain_hw();
   UART4->TDR = (uint8_t)c;
   while (!(UART4->ISR & USART_ISR_TC))
      rx_drain_hw();
}

void cli_init(void)
{
   linelen   = 0;
   busy_flag = false;
   rx_head   = 0;
   rx_tail   = 0;
   /* clear stale RX */
   while (UART4->ISR & USART_ISR_RXNE_RXFNE)
      (void)UART4->RDR;
   /* Re-route printf so that long TX bursts can't drop incoming RX. */
   printf_set_output(cli_putc);
   prompt();
}

void cli_poll(void)
{
   int b;
   while (uart_rx_byte(&b)) {
      char c = (char)b;
      if (c == '\r' || c == '\n') {
         uart_tx_byte('\r');
         uart_tx_byte('\n');
         linebuf[linelen] = '\0';
         dispatch(linebuf);
         linelen = 0;
         prompt();
      } else if (c == '\b' || c == 0x7F) {
         if (linelen > 0) {
            linelen--;
            uart_tx_byte('\b');
            uart_tx_byte(' ');
            uart_tx_byte('\b');
         }
      } else if (c >= 0x20 && c < 0x7F && linelen < LINEMAX) {
         linebuf[linelen++] = c;
         uart_tx_byte(c);
      }
   }
}
